; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-18)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city3)
	(fuel-level plane1 fl2)
	(at plane2 city1)
	(fuel-level plane2 fl3)
	(at plane3 city5)
	(fuel-level plane3 fl2)
	(at plane4 city3)
	(fuel-level plane4 fl2)
	(at plane5 city1)
	(fuel-level plane5 fl2)
	(at plane6 city4)
	(fuel-level plane6 fl1)
	(at plane7 city4)
	(fuel-level plane7 fl5)
	(at person1 city8)
	(at person2 city0)
	(at person3 city7)
	(at person4 city1)
	(at person5 city10)
	(at person6 city10)
	(at person7 city3)
	(at person8 city4)
	(at person9 city4)
	(at person10 city6)
	(at person11 city4)
	(at person12 city10)
	(at person13 city8)
	(at person14 city7)
	(at person15 city2)
	(at person16 city5)
	(at person17 city5)
	(at person18 city8)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city10)
	(at plane7 city0)
	(at person1 city8)
	(at person2 city2)
	(at person3 city0)
	(at person4 city10)
	(at person5 city2)
	(at person6 city1)
	(at person7 city7)
	(at person8 city7)
	(at person9 city1)
	(at person10 city8)
	(at person11 city6)
	(at person12 city6)
	(at person13 city3)
	(at person14 city4)
	(at person15 city4)
	(at person16 city4)
	(at person17 city7)
	(at person18 city1)
	))

)

; plan
1. (fly plane7 city4 city0 fl5 fl4)
   deleted: (at plane7 city4) (fuel-level plane7 fl5)
   added: (at plane7 city0) (fuel-level plane7 fl4)
   goals met: 2 of 20
2. (board person2 plane7 city0)
   deleted: (at person2 city0)
   added: (in person2 plane7)
   goals met: 2 of 20
3. (zoom plane7 city0 city2 fl4 fl3 fl2)
   deleted: (at plane7 city0) (fuel-level plane7 fl4)
   added: (at plane7 city2) (fuel-level plane7 fl2)
   goals met: 1 of 20
4. (debark person2 plane7 city2)
   deleted: (in person2 plane7)
   added: (at person2 city2)
   goals met: 2 of 20
5. (board person15 plane7 city2)
   deleted: (at person15 city2)
   added: (in person15 plane7)
   goals met: 2 of 20
6. (board person9 plane6 city4)
   deleted: (at person9 city4)
   added: (in person9 plane6)
   goals met: 2 of 20
7. (board person8 plane6 city4)
   deleted: (at person8 city4)
   added: (in person8 plane6)
   goals met: 2 of 20
8. (board person11 plane6 city4)
   deleted: (at person11 city4)
   added: (in person11 plane6)
   goals met: 2 of 20
9. (board person17 plane3 city5)
   deleted: (at person17 city5)
   added: (in person17 plane3)
   goals met: 2 of 20
10. (board person16 plane3 city5)
   deleted: (at person16 city5)
   added: (in person16 plane3)
   goals met: 2 of 20
11. (board person4 plane2 city1)
   deleted: (at person4 city1)
   added: (in person4 plane2)
   goals met: 2 of 20
12. (zoom plane2 city1 city10 fl3 fl2 fl1)
   deleted: (at plane2 city1) (fuel-level plane2 fl3)
   added: (at plane2 city10) (fuel-level plane2 fl1)
   goals met: 2 of 20
13. (board person6 plane2 city10)
   deleted: (at person6 city10)
   added: (in person6 plane2)
   goals met: 2 of 20
14. (board person5 plane2 city10)
   deleted: (at person5 city10)
   added: (in person5 plane2)
   goals met: 2 of 20
15. (debark person4 plane2 city10)
   deleted: (in person4 plane2)
   added: (at person4 city10)
   goals met: 3 of 20
16. (board person12 plane2 city10)
   deleted: (at person12 city10)
   added: (in person12 plane2)
   goals met: 3 of 20
17. (zoom plane1 city3 city10 fl2 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl2)
   added: (at plane1 city10) (fuel-level plane1 fl0)
   goals met: 4 of 20
18. (board person7 plane4 city3)
   deleted: (at person7 city3)
   added: (in person7 plane4)
   goals met: 4 of 20
19. (zoom plane4 city3 city7 fl2 fl1 fl0)
   deleted: (at plane4 city3) (fuel-level plane4 fl2)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 4 of 20
20. (debark person7 plane4 city7)
   deleted: (in person7 plane4)
   added: (at person7 city7)
   goals met: 5 of 20
21. (board person3 plane4 city7)
   deleted: (at person3 city7)
   added: (in person3 plane4)
   goals met: 5 of 20
22. (refuel plane4 city7 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 5 of 20
23. (board person14 plane4 city7)
   deleted: (at person14 city7)
   added: (in person14 plane4)
   goals met: 5 of 20
24. (zoom plane7 city2 city0 fl2 fl1 fl0)
   deleted: (at plane7 city2) (fuel-level plane7 fl2)
   added: (at plane7 city0) (fuel-level plane7 fl0)
   goals met: 6 of 20
25. (refuel plane7 city0 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 6 of 20
26. (fly plane4 city7 city0 fl1 fl0)
   deleted: (at plane4 city7) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 6 of 20
27. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 6 of 20
28. (debark person3 plane4 city0)
   deleted: (in person3 plane4)
   added: (at person3 city0)
   goals met: 7 of 20
29. (fly plane4 city0 city4 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 7 of 20
30. (debark person14 plane4 city4)
   deleted: (in person14 plane4)
   added: (at person14 city4)
   goals met: 8 of 20
31. (zoom plane3 city5 city4 fl2 fl1 fl0)
   deleted: (at plane3 city5) (fuel-level plane3 fl2)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 8 of 20
32. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 20
33. (debark person16 plane3 city4)
   deleted: (in person16 plane3)
   added: (at person16 city4)
   goals met: 9 of 20
34. (fly plane3 city4 city7 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 9 of 20
35. (debark person17 plane3 city7)
   deleted: (in person17 plane3)
   added: (at person17 city7)
   goals met: 10 of 20
36. (fly plane7 city0 city4 fl1 fl0)
   deleted: (at plane7 city0) (fuel-level plane7 fl1)
   added: (at plane7 city4) (fuel-level plane7 fl0)
   goals met: 9 of 20
37. (refuel plane7 city4 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 9 of 20
38. (debark person15 plane7 city4)
   deleted: (in person15 plane7)
   added: (at person15 city4)
   goals met: 10 of 20
39. (fly plane7 city4 city0 fl1 fl0)
   deleted: (at plane7 city4) (fuel-level plane7 fl1)
   added: (at plane7 city0) (fuel-level plane7 fl0)
   goals met: 11 of 20
40. (fly plane6 city4 city1 fl1 fl0)
   deleted: (at plane6 city4) (fuel-level plane6 fl1)
   added: (at plane6 city1) (fuel-level plane6 fl0)
   goals met: 11 of 20
41. (refuel plane6 city1 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 11 of 20
42. (debark person9 plane6 city1)
   deleted: (in person9 plane6)
   added: (at person9 city1)
   goals met: 12 of 20
43. (fly plane6 city1 city6 fl1 fl0)
   deleted: (at plane6 city1) (fuel-level plane6 fl1)
   added: (at plane6 city6) (fuel-level plane6 fl0)
   goals met: 12 of 20
44. (refuel plane6 city6 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 12 of 20
45. (debark person11 plane6 city6)
   deleted: (in person11 plane6)
   added: (at person11 city6)
   goals met: 13 of 20
46. (board person10 plane6 city6)
   deleted: (at person10 city6)
   added: (in person10 plane6)
   goals met: 13 of 20
47. (fly plane6 city6 city7 fl1 fl0)
   deleted: (at plane6 city6) (fuel-level plane6 fl1)
   added: (at plane6 city7) (fuel-level plane6 fl0)
   goals met: 13 of 20
48. (refuel plane6 city7 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 13 of 20
49. (debark person8 plane6 city7)
   deleted: (in person8 plane6)
   added: (at person8 city7)
   goals met: 14 of 20
50. (fly plane6 city7 city8 fl1 fl0)
   deleted: (at plane6 city7) (fuel-level plane6 fl1)
   added: (at plane6 city8) (fuel-level plane6 fl0)
   goals met: 14 of 20
51. (board person18 plane6 city8)
   deleted: (at person18 city8)
   added: (in person18 plane6)
   goals met: 14 of 20
52. (refuel plane6 city8 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 14 of 20
53. (board person13 plane6 city8)
   deleted: (at person13 city8)
   added: (in person13 plane6)
   goals met: 14 of 20
54. (debark person10 plane6 city8)
   deleted: (in person10 plane6)
   added: (at person10 city8)
   goals met: 15 of 20
55. (fly plane6 city8 city1 fl1 fl0)
   deleted: (at plane6 city8) (fuel-level plane6 fl1)
   added: (at plane6 city1) (fuel-level plane6 fl0)
   goals met: 15 of 20
56. (refuel plane6 city1 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 15 of 20
57. (debark person18 plane6 city1)
   deleted: (in person18 plane6)
   added: (at person18 city1)
   goals met: 16 of 20
58. (fly plane6 city1 city3 fl1 fl0)
   deleted: (at plane6 city1) (fuel-level plane6 fl1)
   added: (at plane6 city3) (fuel-level plane6 fl0)
   goals met: 16 of 20
59. (debark person13 plane6 city3)
   deleted: (in person13 plane6)
   added: (at person13 city3)
   goals met: 17 of 20
60. (fly plane2 city10 city1 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 17 of 20
61. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 20
62. (debark person6 plane2 city1)
   deleted: (in person6 plane2)
   added: (at person6 city1)
   goals met: 18 of 20
63. (fly plane2 city1 city2 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 18 of 20
64. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 18 of 20
65. (debark person5 plane2 city2)
   deleted: (in person5 plane2)
   added: (at person5 city2)
   goals met: 19 of 20
66. (fly plane2 city2 city6 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 19 of 20
67. (debark person12 plane2 city6)
   deleted: (in person12 plane2)
   added: (at person12 city6)
   goals met: 20 of 20
